; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v3)
		(pred_5 ?v4)
		(pred_3 ?v6)
		(pred_6 ?v6)
		(pred_2 ?v4 ?v6)
		(pred_1)
		(pred_4 ?v4))

   (:action op_3
       :parameters  (?v7 ?v2)
       :precondition (and (not-eq ?v7 ?v2) 
                          (pred_3 ?v7) (pred_3 ?v2) (pred_6 ?v7))
       :effect (and  (pred_6 ?v2)
		     (not (pred_6 ?v7))))


   (:action op_1
       :parameters (?v8 ?v1)
       :precondition  (and  (pred_5 ?v8) (pred_3 ?v1)
			    (pred_2 ?v8 ?v1) (pred_6 ?v1) (pred_1))
       :effect (and (pred_4 ?v8)
		    (not (pred_2 ?v8 ?v1)) 
		    (not (pred_1))))

   (:action op_2
       :parameters  (?v8  ?v1)
       :precondition  (and  (pred_5 ?v8) (pred_3 ?v1)
			    (pred_4 ?v8) (pred_6 ?v1))
       :effect (and (pred_2 ?v8 ?v1)
		    (pred_1)
		    (not (pred_4 ?v8)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_05 obj_06 obj_02 
          obj_01 obj_04 obj_03 
)
(:init
(pred_3 obj_05)
(pred_3 obj_06)
(pred_3 obj_02)
(pred_5 obj_01)
(pred_5 obj_04)
(pred_5 obj_03)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_1)
(pred_2 obj_01 obj_02)
(pred_2 obj_04 obj_06)
(pred_2 obj_03 obj_05)
(pred_6 obj_06)
)
(:goal
(and
(pred_2 obj_01 obj_02)
(pred_2 obj_04 obj_05)
(pred_2 obj_03 obj_05)
)
)

(:constraints
  (sometime-before  (pred_2 obj_04 obj_05) (pred_6 obj_02))
)
)

; plan
1. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04 obj_06) (pred_1)
   added: (pred_4 obj_04)
   goals met: 2 of 3
2. (op_3 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_02)
   goals met: 2 of 3
3. (op_2 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_1)
   goals met: 2 of 3
4. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 2 of 3
5. (op_1 obj_03 obj_05)
   deleted: (pred_2 obj_03 obj_05) (pred_1)
   added: (pred_4 obj_03)
   goals met: 1 of 3
6. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 1 of 3
7. (op_2 obj_03 obj_02)
   deleted: (pred_4 obj_03)
   added: (pred_2 obj_03 obj_02) (pred_1)
   goals met: 1 of 3
8. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04 obj_02) (pred_1)
   added: (pred_4 obj_04)
   goals met: 1 of 3
9. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 1 of 3
10. (op_2 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_05) (pred_1)
   goals met: 2 of 3
11. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 2 of 3
12. (op_1 obj_03 obj_02)
   deleted: (pred_2 obj_03 obj_02) (pred_1)
   added: (pred_4 obj_03)
   goals met: 2 of 3
13. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 2 of 3
14. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_2 obj_03 obj_05) (pred_1)
   goals met: 3 of 3
